In [5]:
import pandas as pd

# Create a sample DataFrame with duplicate rows
data = {'Name': ['Ross', 'Bob', 'Ross', 'Geoffrey', 'Bob'],
        'Age': [25, 30, 27, 22, 30],
        'Salary': [50000, 60000, 50000, 45000, 60000]}

df = pd.DataFrame(data)
df

       Name  Age  Salary
0      Ross   25   50000
1       Bob   30   60000
2      Ross   27   50000
3  Geoffrey   22   45000
4       Bob   30   60000

In [6]:
newdf = df.drop_duplicates()
newdf

       Name  Age  Salary
0      Ross   25   50000
1       Bob   30   60000
2      Ross   27   50000
3  Geoffrey   22   45000